Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg53/edc/ATSAMG53N19.PIC
      <edc:AdjustPoint edc:_addr="0x40030008" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40030014" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PDMIC1_CDR" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Converted" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030018" edc:access="---ww-ww------------------------" edc:cname="PDMIC1_IER" edc:impl="0x1B000000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003001C" edc:access="---ww-ww------------------------" edc:cname="PDMIC1_IDR" edc:impl="0x1B000000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="General Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030020" edc:access="---rr-rr------------------------" edc:cname="PDMIC1_IMR" edc:impl="0x1B000000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="General Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030024" edc:access="---rr-rrrrrrrrrr----------------" edc:cname="PDMIC1_ISR" edc:impl="0x1BFF0000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="FIFOCNT" edc:desc="FIFO Count" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of RX Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="RX Buffer Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40030028" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x40030058" edc:access="----------------nnnnnnnn-nnnnnn-" edc:cname="PDMIC1_DSPR0" edc:impl="0xFF7E" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HPFBYP" edc:desc="High-Pass Filter Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SINBYP" edc:desc="SINCC Filter Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Data Size" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:desc="Oversampling Ratio" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="Oversampling ratio is 128" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="Oversampling ratio is 64" edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCALE" edc:desc="Data Scale" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SHIFT" edc:desc="Data Shift" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003005C" edc:access="----------------nnnnnnnn-nnnnnn-" edc:cname="PDMIC1_DSPR1" edc:impl="0xFF7E" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HPFBYP" edc:desc="High-Pass Filter Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SINBYP" edc:desc="SINCC Filter Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Data Size" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:desc="Oversampling Ratio" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="Oversampling ratio is 128" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="Oversampling ratio is 64" edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCALE" edc:desc="Data Scale" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SHIFT" edc:desc="Data Shift" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
