Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg53/edc/ATSAMG53N19.PIC
      <edc:AdjustPoint edc:_addr="0x400E10EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E1100" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PIOB_SCHMITT" edc:nzwidth="0x20" ltx:memberofperipheral="PIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOB">
            <edc:SFRFieldDef edc:cname="SCHMITT0" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT1" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT2" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT3" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT4" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT5" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT6" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT7" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT8" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT9" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT10" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT11" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT12" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT13" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT14" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT15" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT16" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT17" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT18" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT19" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT20" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT21" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT22" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT23" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT24" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT25" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT26" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT27" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT28" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT29" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT30" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT31" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E1104" edc:offset="0x2FC"/>
      <edc:SFRDef edc:_addr="0x400E1400" edc:access="wwwwwwww--------------------ww-w" edc:cname="RSTC_CR" edc:impl="0xFF00000D" edc:nzwidth="0x20" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="PROCRST" edc:desc="Processor Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRST" edc:desc="Peripheral Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTRST" edc:desc="External Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="System Reset Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1404" edc:access="--------------rr-----rrr-------r" edc:cname="RSTC_SR" edc:impl="0x30701" edc:nzwidth="0x20" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="URSTS" edc:desc="User Reset Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RSTTYP" edc:desc="Reset Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="GENERAL_RST" edc:desc="First power-up reset" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WDT_RST" edc:desc="Watchdog fault occurred" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SOFT_RST" edc:desc="Processor reset required by the software" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="USER_RST" edc:desc="NRST pin detected low" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="NRSTL" edc:desc="NRST Pin Level" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRCMP" edc:desc="Software Reset Command in Progress" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1408" edc:access="nnnnnnnn------------nnnn---n---n" edc:cname="RSTC_MR" edc:impl="0xFF000F11" edc:nzwidth="0x20" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="URSTEN" edc:desc="User Reset Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URSTIEN" edc:desc="User Reset Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERSTL" edc:desc="External Reset Length" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Write Access Password" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
